Sequential(
  (0): SimpleLSTM(
    (lstm): LSTM(4, 15, num_layers=3, batch_first=True)
  )
  (1): LSTMNoSequenceAdapter()
  (2): Sequential(
    (0): Linear(in_features=15, out_features=1, bias=True)
    (1): Identity()
  )
)
