Sequential(
  (0): SimpleLSTM(
    (lstm): LSTM(4, 10, num_layers=2, batch_first=True)
  )
  (1): LSTMNoSequenceAdapter()
  (2): Sequential(
    (0): Linear(in_features=10, out_features=1, bias=True)
    (1): Identity()
  )
)
